20260131140313-trek_notes_template.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 08:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>trek notes template</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">trek notes template</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb2bb767">Trek Overview</a></li>
<li><a href="#orgc17c359">Schedule &amp; Companions</a></li>
<li><a href="#org78b8f70">Route Information</a></li>
<li><a href="#orgb8cfcf4">Historical / Mythological Background</a></li>
<li><a href="#orgeb02a0e">Key Landmarks &amp; Attractions</a></li>
<li><a href="#orgae01e69">Experience &amp; Observations</a></li>
<li><a href="#orgf6bc665">Facilities &amp; Amenities</a></li>
<li><a href="#org607a18a">Local Notes</a></li>
<li><a href="#org5835d43">Photos &amp; Media</a></li>
<li><a href="#orgad95f3f">Reflection</a></li>
</ul>
</div>
</div>
<p>
#+
TITLE: Trek Log - &lt;TREK NAME&gt;
</p>

<div id="outline-container-orgb2bb767" class="outline-2">
<h2 id="orgb2bb767">Trek Overview</h2>
<div class="outline-text-2" id="text-orgb2bb767">
<ul class="org-ul">
<li>Trek Name:</li>
<li>Region:</li>
<li>Range:</li>
<li>Base Village:</li>
<li>Height from MSL (ft):</li>
<li>Type:
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> hill fort</li>
<li class="off"><code>[&#xa0;]</code> forest trail</li>
<li class="off"><code>[&#xa0;]</code> plateau</li>
</ul></li>
<li>Difficulty Level:</li>
<li class="off"><code>[&#xa0;]</code> easy</li>
<li class="off"><code>[&#xa0;]</code> moderate</li>
<li class="off"><code>[&#xa0;]</code> difficult</li>
<li>Best Season:</li>
<li class="off"><code>[&#xa0;]</code> winter</li>
<li class="off"><code>[&#xa0;]</code> summer</li>
<li class="off"><code>[&#xa0;]</code> monsoon</li>
<li>Time taken to Climb [hrs]:</li>
<li>Water Availability:</li>
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
<li>Suitable For:</li>
<li class="off"><code>[&#xa0;]</code> beginners</li>
<li class="off"><code>[&#xa0;]</code> regular trekkers</li>
<li class="off"><code>[&#xa0;]</code> families</li>
</ul>
</div>
</div>

<div id="outline-container-orgc17c359" class="outline-2">
<h2 id="orgc17c359">Schedule &amp; Companions</h2>
<div class="outline-text-2" id="text-orgc17c359">
<ul class="org-ul">
<li>Date:</li>
<li>Team Members:</li>
<li>Wake-up Time:</li>
<li>Left Home:</li>
<li>Start Point / Meeting Place:</li>
<li>Route Start Time:</li>
<li>Return Time:</li>
<li>Key Stops / Temples / Checkpoints:
<ul class="org-ul">
<li></li>

<li></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org78b8f70" class="outline-2">
<h2 id="org78b8f70">Route Information</h2>
<div class="outline-text-2" id="text-org78b8f70">
<ul class="org-ul">
<li>Route from Base City:</li>
<li>Final Village Distance km:</li>
<li>Public Transport Availability:</li>
<li>Parking / Auto / Petrol:</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8cfcf4" class="outline-2">
<h2 id="orgb8cfcf4">Historical / Mythological Background</h2>
<div class="outline-text-2" id="text-orgb8cfcf4">
<ul class="org-ul">
<li>Historical Importance:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Legends / Myths:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Nearby Heritage / Religious Sites:
<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb02a0e" class="outline-2">
<h2 id="orgeb02a0e">Key Landmarks &amp; Attractions</h2>
<div class="outline-text-2" id="text-orgeb02a0e">
<ul class="org-ul">
<li>Temples:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Structures (Bastions, Caves, Gates, etc.):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Viewpoints (Ranges / Dams visible):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Not to Miss:
<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgae01e69" class="outline-2">
<h2 id="orgae01e69">Experience &amp; Observations</h2>
<div class="outline-text-2" id="text-orgae01e69">
<ul class="org-ul">
<li>Weather / Terrain:</li>
<li>Notable Sights:</li>
<li>Personal Experience:</li>
<li>Vibe / Mood of Place:</li>
<li>Tips for Future Trekkers:</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6bc665" class="outline-2">
<h2 id="orgf6bc665">Facilities &amp; Amenities</h2>
<div class="outline-text-2" id="text-orgf6bc665">
<ul class="org-ul">
<li>Food / Water Availability:</li>
<li>Accommodation / Prasadam Timings:</li>
<li>Shops / Auto Repair / Petrol Info:</li>
<li>Guide Needed:</li>
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
</ul>
</div>
</div>

<div id="outline-container-org607a18a" class="outline-2">
<h2 id="org607a18a">Local Notes</h2>
<div class="outline-text-2" id="text-org607a18a">
<ul class="org-ul">
<li>Village Population / Details:</li>
<li>Major FoodCrops:</li>
<li>Local Culture / People:</li>
</ul>
</div>
</div>

<div id="outline-container-org5835d43" class="outline-2">
<h2 id="org5835d43">Photos &amp; Media</h2>
<div class="outline-text-2" id="text-org5835d43">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Add photos</li>
<li class="off"><code>[&#xa0;]</code> Add route map (GPS screenshot)</li>
<li class="off"><code>[&#xa0;]</code> Add group photo</li>
</ul>
</div>
</div>

<div id="outline-container-orgad95f3f" class="outline-2">
<h2 id="orgad95f3f">Reflection</h2>
<div class="outline-text-2" id="text-orgad95f3f">
<ul class="org-ul">
<li>What I Loved Most:</li>
<li>What I’d Improve Next Time:</li>
<li>Recommend To:</li>
<li>Return Visit:</li>
<li class="off"><code>[&#xa0;]</code> yes/no</li>
<li class="off"><code>[&#xa0;]</code> (why?)</li>
</ul>
</div>
</div>
</div>
</body>
</html>